{
  "instance_id": "83NYOV",
  "problem_statement": "The provided Prisma schema for an e-commerce system is critically flawed in both concept and execution. Affected models include Store, Billboard, Category, Product, Size, Color, Order, and OrderItem. Key issues include circular ownership (Billboard → Category → Product → Store → Billboard), over-coupled entities where Product references Store, Category, Size, and Color redundantly, missing @relation directives and relation names, undefined or inconsistent cascade behavior (onDelete rules missing), missing critical models such as User and lack of tenant enforcement, and redundant foreign keys along with arrays that lack relation names. The impact is that Prisma will auto-infer relations incorrectly, causing migration failures, broken queries, and an unstable schema.",
  "base_commit": "repository_before/",
  "test_patch": "tests/",
  "github_url": "https://github.com/ep-eaglepoint-ai/bd_datasets_002/tree/main/83nyov-fixing-e-commerce-schema",
  "environment_setup": "Dockerfile",
  "FAIL_TO_PASS": [
    "tests/schema.test.ts::should pass prisma validate",
    "tests/schema.test.ts::should have User model",
    "tests/schema.test.ts::should have Store model with owner/user relation",
    "tests/schema.test.ts::should have userId field in Store model",
    "tests/schema.test.ts::should have all Store relations with explicit names",
    "tests/schema.test.ts::should have Billboard to Category relation named",
    "tests/schema.test.ts::should have Category to Product relation named",
    "tests/schema.test.ts::should have Size to Product relation named",
    "tests/schema.test.ts::should have Color to Product relation named",
    "tests/schema.test.ts::should have Product to Image relation named",
    "tests/schema.test.ts::should have Order to OrderItem relation named",
    "tests/schema.test.ts::should have Product to OrderItem relation named",
    "tests/schema.test.ts::should not have standalone ownerId in Store (replaced by userId)",
    "tests/schema.test.ts::should have Cascade delete on Store to Billboard",
    "tests/schema.test.ts::should have Cascade delete on Store to Category",
    "tests/schema.test.ts::should have Cascade delete on Store to Product",
    "tests/schema.test.ts::should have Cascade delete on Store to Size",
    "tests/schema.test.ts::should have Cascade delete on Store to Color",
    "tests/schema.test.ts::should have Cascade delete on Store to Order",
    "tests/schema.test.ts::should have Cascade delete on Billboard to Category",
    "tests/schema.test.ts::should have Cascade delete on Product to Image",
    "tests/schema.test.ts::should have Cascade delete on Order to OrderItem",
    "tests/schema.test.ts::should have proper indexes for tenant isolation (relationMode = prisma)",
    "tests/schema.test.ts::should enforce Store boundary on all tenant-scoped relations"
  ],
  "PASS_TO_PASS": [
    "tests/schema.test.ts::should have foreign key fields only on the owning side of relations",
    "tests/schema.test.ts::should not have circular ownership patterns",
    "tests/schema.test.ts::should have Store as the tenant root with all tenant-scoped models referencing it",
    "tests/schema.test.ts::should have Store arrays reference correct models",
    "tests/schema.test.ts::should have Billboard array in Category model",
    "tests/schema.test.ts::should have Product arrays in Size and Color models",
    "tests/schema.test.ts::should have Image array in Product model",
    "tests/schema.test.ts::should have OrderItem array in Order and Product models",
    "tests/schema.test.ts::should preserve all original models",
    "tests/schema.test.ts::should preserve Store fields",
    "tests/schema.test.ts::should preserve Billboard fields",
    "tests/schema.test.ts::should preserve Category fields",
    "tests/schema.test.ts::should preserve Product fields",
    "tests/schema.test.ts::should preserve Order fields",
    "tests/schema.test.ts::should preserve OrderItem structure"
  ]
}
